//TODO Дз на закрепление:
//     Взять реализованный код в рамках последних семинаров (4-5) и продемонстрировать применение принципов,
//     усвоенных на семинаре. Нужно в проекте прокомментировать участки кода, которые
//     рефакторим, какой принцип применяем и почему.
//     Формат сдачи: ссылка на гитхаб проект
//     3*) Создать систему управления складом(SOLID)
//     a) Product должен хранит информацию о товаре, такую как название, количество, цена и тд. (decreaseQuantity(int amount) , increaseQuantity(int amount))
//     b) Warehouse должен управлять запасами товаров на складе, обеспечивает их хранение и выдачу.(добавление/удаление продукта, увеличение/уменьшение количества продукта)
//     c) Order должен отвечать за обработку заказов на товары со склада. (processOrder(Product product, int amount)- обработка заказа)
//     4*) Написать класс Circle- который удовлетворяет принципам SOLID (повтор лекции)